// modules/ime/phoneticMap.js
export const vowels = {
  aa: "আ", A: "আ", ii: "ঈ", I: "ঈ", uu: "ঊ", U: "ঊ", OI: "ঐ", OU: "ঔ", O: "ও", o: "অ",
  a: "আ", i: "ই", u: "উ", e: "এ", rri: "ঋ"
};
export const matras = {
  yaa: "্যা", ya: "্যা", yA: "্যা", yi: "্যি", yii: "্যী", yI: "্যী", yu: "্যু", yuu: "্যূ", yU: "্যূ", ye: "্যে", yo: "্য", yO: "্যো", yoi: "্য়ৈ", yOI: "্য়ৈ", yOU: "্যৌ",
  aa: "া", A: "া", ii: "ী", I: "ী", uu: "ূ", U: "ূ", OI: "ৈ", OU: "ৌ", O: "ো", o: "",
  i: "ি", u: "ু", e: "ে", a: "া", rri: "ৃ", "y": "্য", "Y": "্য", "'": "\u200C"
};
export const consonantRules = [
  ["ssh", "ষ"], ["kkh", "ক্ষ"], ["t``", "ৎ"], ["t''", "ৎ"], ["Sh", "ষ"], ["kh", "খ"], ["gh", "ঘ"], ["ch", "ছ"], ["jh", "ঝ"], ["Th", "ঠ"],
  ["Dh", "ঢ"], ["th", "থ"], ["dh", "ধ"], ["ph", "ফ"], ["bh", "ভ"], ["sh", "শ"], ["NG", "ঞ"], ["Ng", "ঙ"], ["ng", "ং"], ["Rh", "ঢ়"],
  ["s`", "স"], ["f", "ফ"], ["k", "ক"], ["g", "গ"], ["c", "চ"], ["j", "জ"], ["T", "ট"], ["D", "ড"], ["N", "ণ"], ["t", "ত"], ["d", "দ"],
  ["n", "ন"], ["p", "প"], ["f", "ফ"], ["b", "ব"], ["v", "ভ"], ["m", "ম"], ["y", "য়"], ["z", "য"], ["r", "ৰ"], ["R", "ড়"],
  ["l", "ল"], ["w", "ৱ"], ["S", "স"], ["s", "ছ"], ["h", "হ"], [":", "ঃ"], ["^", "ঁ"]
];
export const symbolRules = [
  [",,", "্‌"], [".", "।"], ["!", "!"], ["?", "?"], [";", ";"], ["(", "("], [")", ")"], ["-", "-"], ["+", "+"], ["*", "*"]
];
export const conjunctionRules = [
   ["", ""],
];
export const numberRules = [
  ["1", "১"], ["2", "২"], ["3", "৩"], ["4", "৪"], ["5", "৫"], ["6", "৬"], ["7", "৭"], ["8", "৮"], ["9", "৯"], ["0", "০"]
];

